In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import datetime

In [62]:
answers = pd.read_csv("data/answers.csv")
answers_scores = pd.read_csv("data/answer_scores.csv")

#comments = pd.read_csv("data/comments.csv")

emails1 = pd.read_csv("data/emails1.csv")
emails2 = pd.read_csv("data/emails2.csv")
emails = pd.concat([emails1,emails2])

group_members = pd.read_csv("data/group_memberships.csv")
groups = pd.read_csv("data/groups.csv")

matches1 = pd.read_csv("data/matches1.csv")
matches2 = pd.read_csv("data/matches2.csv")
matches3 = pd.read_csv("data/matches3.csv")
matches = pd.concat([matches1,matches2,matches3])

professionals = pd.read_csv("data/professionals.csv")

questions = pd.read_csv("data/questions.csv")
question_scores = pd.read_csv("data/question_scores.csv")

schools_members = pd.read_csv("data/school_memberships.csv")
students = pd.read_csv("data/students.csv")

tag_users = pd.read_csv("data/tag_users.csv")
tag_questions = pd.read_csv("data/tag_questions.csv")
tags = pd.read_csv("data/tags.csv")

In [63]:
tag_users.head(3)

   tag_users_tag_id                 tag_users_user_id
0               593  c72ab38e073246e88da7e9a4ec7a4472
1              1642  8db519781ec24f2e8bdc67c2ac53f614
2               638  042d2184ee3e4e548fc3589baaa69caf

In [64]:
professionals

,professionals_id,professionals_location,professionals_industry,professionals_headline,professionals_date_joined
0,9ced4ce7519049c0944147afb75a8ce3,NaN,NaN,NaN,2011-10-05 20:35:19 UTC+0000
1,f718dcf6d2ec4cb0a52a9db59d7f9e67,NaN,NaN,NaN,2011-10-05 20:49:21 UTC+0000
2,0c673e046d824ec0ad0ebe012a0673e4,"New York, New York",NaN,NaN,2011-10-18 17:31:26 UTC+0000
3,977428d851b24183b223be0eb8619a8c,"Boston, Massachusetts",NaN,NaN,2011-11-09 20:39:29 UTC+0000
4,e2d57e5041a44f489288397c9904c2b2,NaN,NaN,NaN,2011-12-10 22:14:44 UTC+0000
...,...,...,...,...,...
28147,9f267950ab8e43e2afcf564327049297,"El Segundo, California",Broadcast Media,"AVP, Technology at AT&T",2019-01-31 23:48:32 UTC+0000
28148,4a7e1e5dd884488da283e1cab6ad11e0,"Alexandria, Virginia",Telecommunications,"Operations Manager, FirstNet Public Sector Sol...",2019-01-31 23:53:53 UTC+0000
28149,ea75c5fce38348e0a151c3c346929e6a,"Berkeley, California",Electrical engineering Computer Software,GMA3 at Tesla,2019-01-31 23:56:16 UTC+0000
28150,34f6222c3c02480ca2df8a3e4ba878d0,"Houston, Texas Area",Telecommunications,Customer Service Representative at AT&T,2019-01-31 23:58:31 UTC+0000
28151,ebc523719253485bb35e94ca561eb051,"Dallas, Texas",Mobility and Entertainment,Director - Program and Project Management,2019-01-31 23:59:09 UTC+0000

In [65]:
schools_members

      school_memberships_school_id        school_memberships_user_id
0                           197406  23dce13ca6164a73aec7a3cd56a4884d
1                           197398  23dce13ca6164a73aec7a3cd56a4884d
2                           199821  23dce13ca6164a73aec7a3cd56a4884d
3                           186239  9c5803ae43ca4cf6b27ea85871625116
4                           182063  9c5803ae43ca4cf6b27ea85871625116
...                            ...                               ...
5633                        196377  a8a936e405204420a981ffec2ae0dc98
5634                        196396  a8a936e405204420a981ffec2ae0dc98
5635                        196700  de2415064b9b445c8717425ed70fd99a
5636                        198038  de2415064b9b445c8717425ed70fd99a
5637                        197243  46277aad38704d319e8f953b5592819c

[5638 rows x 2 columns]

In [66]:
x = pd.merge(professionals,schools_members, how = 'left', left_on = 'professionals_id', right_on = 'school_memberships_user_id')
x[x.school_memberships_school_id.notnull()]
x

,professionals_id,professionals_location,professionals_industry,professionals_headline,professionals_date_joined,school_memberships_school_id,school_memberships_user_id
0,9ced4ce7519049c0944147afb75a8ce3,NaN,NaN,NaN,2011-10-05 20:35:19 UTC+0000,NaN,NaN
1,f718dcf6d2ec4cb0a52a9db59d7f9e67,NaN,NaN,NaN,2011-10-05 20:49:21 UTC+0000,NaN,NaN
2,0c673e046d824ec0ad0ebe012a0673e4,"New York, New York",NaN,NaN,2011-10-18 17:31:26 UTC+0000,NaN,NaN
3,977428d851b24183b223be0eb8619a8c,"Boston, Massachusetts",NaN,NaN,2011-11-09 20:39:29 UTC+0000,NaN,NaN
4,e2d57e5041a44f489288397c9904c2b2,NaN,NaN,NaN,2011-12-10 22:14:44 UTC+0000,NaN,NaN
...,...,...,...,...,...,...,...
30309,9f267950ab8e43e2afcf564327049297,"El Segundo, California",Broadcast Media,"AVP, Technology at AT&T",2019-01-31 23:48:32 UTC+0000,NaN,NaN
30310,4a7e1e5dd884488da283e1cab6ad11e0,"Alexandria, Virginia",Telecommunications,"Operations Manager, FirstNet Public Sector Sol...",2019-01-31 23:53:53 UTC+0000,NaN,NaN
30311,ea75c5fce38348e0a151c3c346929e6a,"Berkeley, California",Electrical engineering Computer Software,GMA3 at Tesla,2019-01-31 23:56:16 UTC+0000,NaN,NaN
30312,34f6222c3c02480ca2df8a3e4ba878d0,"Houston, Texas Area",Telecommunications,Customer Service Representative at AT&T,2019-01-31 23:58:31 UTC+0000,NaN,NaN
30313,ebc523719253485bb35e94ca561eb051,"Dallas, Texas",Mobility and Entertainment,Director - Program and Project Management,2019-01-31 23:59:09 UTC+0000,NaN,NaN

In [67]:
students

,students_id,students_location,students_date_joined
0,12a89e96755a4dba83ff03e03043d9c0,NaN,2011-12-16 14:19:24 UTC+0000
1,e37a5990fe354c60be5e87376b08d5e3,NaN,2011-12-27 03:02:44 UTC+0000
2,12b402cceeda43dcb6e12ef9f2d221ea,NaN,2012-01-01 05:00:00 UTC+0000
3,a0f431fc79794edcb104f68ce55ab897,NaN,2012-01-01 05:00:00 UTC+0000
4,23aea4702d804bd88d1e9fb28074a1b4,NaN,2012-01-01 05:00:00 UTC+0000
...,...,...,...
30966,1154f74f4ac14aaf8ef1b15cdda2b84f,"Ottumwa, Iowa",2019-01-31 19:13:15 UTC+0000
30967,008c7ebabbdf4e7382870d172e6e6691,"Ottumwa, Iowa",2019-01-31 19:14:18 UTC+0000
30968,c445148b5fc8472da00f50b86dfd8faa,"Heckmondwike, England, United Kingdom",2019-01-31 21:04:31 UTC+0000
30969,44b3515e25454cfb80ed1df3a2a23f61,"Clermont, Florida",2019-01-31 22:29:57 UTC+0000
30970,1de9d7d0329e40e6996bbc92d13c6a00,NaN,2019-01-31 23:13:23 UTC+0000

In [68]:
tags.head(3)

   tags_tag_id      tags_tag_name
0        27490            college
1          461   computer-science
2          593  computer-software

In [69]:
professionals[professionals.professionals_id == '1d9ba1fe480f491a918a89688c4aa053']

,professionals_id,professionals_location,professionals_industry,professionals_headline,professionals_date_joined
16178,1d9ba1fe480f491a918a89688c4aa053,"Southfield, Michigan",Telecommunications,Senior Technical Project Manager,2018-02-19 20:10:59 UTC+0000

In [70]:
tag_questions

       tag_questions_tag_id         tag_questions_question_id
0                     28930  cb43ebee01364c68ac61d347a393ae39
1                     28930  47f55e85ce944242a5a347ab85a8ffb4
2                     28930  ccc30a033a0f4dfdb2eb987012f25792
3                     28930  e30b274e48d741f7bf50eb5e7171a3c0
4                     28930  3d22742052df4989b311b4195cbb0f1a
...                     ...                               ...
76548                 39183  72affe86909d49c09761a1d376476c92
76549                 39248  5b86153f2b6c46a4801bb39e10e01281
76550                 39249  0946a81d511b48c58376fd59058d3b12
76551                 39249  b4de8ccfcd874481bfc80ceacb0caac8
76552                 39250  0946a81d511b48c58376fd59058d3b12

[76553 rows x 2 columns]

In [71]:
def get_user_tags(user_id):
    user_tags = tag_users[tag_users["tag_users_user_id"] == user_id]["tag_users_tag_id"]
    tags_names =tags.loc[tags["tags_tag_id"].isin(user_tags)]
    return(tags)

In [72]:
def get_user_answers(user_id):
    all_answers = answers.loc[answers["answers_author_id"]==user_id]
    return all_answers

In [73]:
def match_email_question(email_date):
    f = lambda x: datetime.datetime.strptime(x, "%Y-%m-%d %H:%M:%S UTC+0000")
    b  =f(email_date)
    t = questions["questions_date_added"].apply(f)
    return questions.iloc[(b-t).abs().argsort()[:1]]

In [74]:
immediate_emails = emails[emails["emails_frequency_level"]=="email_notification_immediate"]
immediate_matches = matches[matches["matches_email_id"].isin(immediate_emails["emails_id"])]
immediate_emails = immediate_emails[immediate_emails["emails_id"].isin(matches["matches_email_id"])]
immediate_emails = immediate_emails.rename(columns={'emails_id':"id"})
immediate_matches = immediate_matches.rename(columns={'matches_email_id':"id"})

In [75]:
emails_questions = pd.merge(immediate_emails, immediate_matches, how="left", on="id")
emails_questions = emails_questions.rename(columns = {"matches_question_id": "question_id", "emails_recipient_id": "professional_id"})
answers = answers.rename(columns = {"answers_question_id": "question_id", "answers_author_id": "professional_id"})

In [76]:
full_data = pd.merge(emails_questions, answers,how='left',  on=["professional_id","question_id" ])
target = full_data['answers_id'].fillna(0)
target = pd.to_numeric(target, errors='coerce').fillna(1).astype(int)
full_data["q_answered"] = target
full_data = full_data.rename(columns = {"id": "email_id"})
date_vectorizer = lambda x: datetime.datetime.strptime(x, "%Y-%m-%d %H:%M:%S UTC+0000")
full_data["emails_date_sent"] = full_data["emails_date_sent"].apply(date_vectorizer)
indices = full_data["answers_date_added"][full_data["answers_date_added"].notnull()].index.values
full_data.loc[indices, "answers_date_added"] = full_data["answers_date_added"][full_data["answers_date_added"].notnull()].apply(date_vectorizer)
full_data["time_taken"] =  pd.to_datetime(full_data["answers_date_added"]) - pd.to_datetime(full_data["emails_date_sent"])
indices2 = full_data["time_taken"][full_data["time_taken"] < datetime.timedelta( days=0)].index.values
full_data.loc[indices2, "time_taken"]=datetime.timedelta(days=0, seconds=0,minutes=0, hours=0 )

In [77]:
response = full_data.groupby("professional_id").mean().drop(columns = ["email_id"]).reset_index()
professionals_dataset = pd.DataFrame(columns = ["professional_id"])
professionals_dataset["professional_id"] = professionals["professionals_id"]
professionals_dataset = pd.merge(professionals_dataset, response,how='left',  on=["professional_id" ])
professionals_dataset = professionals_dataset.rename(columns = {"q_answered": "response_rate"})
grouped = full_data.groupby('professional_id')["time_taken"]
time_mean = grouped.apply(lambda x: np.mean(x))
professionals_dataset = pd.merge(professionals_dataset, time_mean,how='left',  on=["professional_id" ])
professionals_dataset=  professionals_dataset.rename(columns ={"time_taken": "avg_time_taken"})
answers_count = answers["professional_id"].value_counts().reset_index().rename(columns = {"professional_id":"number_q_answered","index":"professional_id",  })
professionals_dataset = pd.merge(professionals_dataset, answers_count,how='left',  on=["professional_id" ])
all_tags = pd.merge(tag_users.rename(columns = {"tag_users_tag_id": "tag_id"}),tags.rename(columns = {"tags_tag_id": "tag_id"}),how='left',  on=["tag_id" ])
foll_tags = all_tags.groupby('tag_users_user_id')['tags_tag_name'].apply(list).reset_index(name='following_tags').rename(columns = {"tag_users_user_id": "professional_id"})
professionals_dataset = pd.merge(professionals_dataset, foll_tags,how='left',  on=["professional_id" ])
a = pd.merge(answers["question_id"].reset_index(), tag_questions.rename(columns = {"tag_questions_question_id": "question_id"}),how='left',  on=["question_id" ])
b = pd.merge(a.rename(columns = {"tag_questions_tag_id":"tags_tag_id"}), tags,how='left',  on=["tags_tag_id" ]).drop(columns = ["index", "tags_tag_id"])
c = pd.merge(b, answers,how='left',  on=["question_id" ]).drop(columns = ["answers_id", "answers_date_added", "answers_body", "question_id"])
d = c.groupby("professional_id")["tags_tag_name"].apply(list).reset_index()
professionals_dataset = pd.merge(professionals_dataset, d.rename(columns = {"tags_tag_name": "prev_q_tags"}),how='left',  on=["professional_id" ])
prof_score = pd.merge(answers[["professional_id","answers_id" ]], answers_scores.rename(columns = {"id":"answers_id"}),how='left',  on=["answers_id" ]).drop(columns = ["answers_id"])
prof_score.groupby("professional_id").mean().reset_index()
professionals_dataset = pd.merge(professionals_dataset,prof_score,how='left',  on=["professional_id" ]).rename(columns = {"score":"avg_ansrs_score"})
prof_grp = group_members["group_memberships_user_id"].value_counts().reset_index().rename(columns = {"index":"professional_id", "group_memberships_user_id":"num_groups"})
professionals_dataset = pd.merge(professionals_dataset,prof_grp,how='left',  on=["professional_id" ])
prof_schl = schools_members["school_memberships_user_id"].value_counts().reset_index().rename(columns = {"index":"professional_id", "school_memberships_user_id":"num_schools"})
professionals_dataset = pd.merge(professionals_dataset,prof_schl,how='left',  on=["professional_id" ])
prof_emls = immediate_emails["emails_recipient_id"].value_counts().reset_index().rename(columns = {"index":"professional_id", "emails_recipient_id":"num_emails"})
professionals_dataset = pd.merge(professionals_dataset,prof_emls,how='left',  on=["professional_id" ])
professionals_dataset["answrs_emails_ratio"] = professionals_dataset["number_q_answered"] / professionals_dataset["num_emails"]

In [79]:
professionals_dataset.head(3)

,professional_id,Unnamed: 0_x,Unnamed: 0_y,response_rate,avg_time_taken,number_q_answered,following_tags,prev_q_tags,avg_ansrs_score,num_groups,num_schools,num_emails,answrs_emails_ratio
0,9ced4ce7519049c0944147afb75a8ce3,NaN,NaN,NaN,NaT,1.0,NaN,"[consulting, resume, consulting, resume, consu...",5.0,NaN,NaN,NaN,NaN
1,f718dcf6d2ec4cb0a52a9db59d7f9e67,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,0c673e046d824ec0ad0ebe012a0673e4,329.342857,2.402384e+06,0.0,NaT,39.0,"[consulting, education, consulting, education,...","[experience, healthcare, doctor, anesthesiolog...",1.0,NaN,NaN,70.0,0.557143

In [80]:
professionals.head(3)

,professionals_id,professionals_location,professionals_industry,professionals_headline,professionals_date_joined
0,9ced4ce7519049c0944147afb75a8ce3,NaN,NaN,NaN,2011-10-05 20:35:19 UTC+0000
1,f718dcf6d2ec4cb0a52a9db59d7f9e67,NaN,NaN,NaN,2011-10-05 20:49:21 UTC+0000
2,0c673e046d824ec0ad0ebe012a0673e4,"New York, New York",NaN,NaN,2011-10-18 17:31:26 UTC+0000

In [81]:
professionals_dataset["answrs_emails_ratio"][professionals_dataset["answrs_emails_ratio"]> 1]

309       2.333333
310       2.333333
311       2.333333
312       2.333333
313       2.333333
           ...
63384    13.000000
63385    13.000000
63386    13.000000
63387    13.000000
63388    13.000000
Name: answrs_emails_ratio, Length: 7622, dtype: float64

In [82]:
match_proff = pd.merge(matches.rename(columns = {"matches_email_id":"emails_id"}), emails,how='left',  on=["emails_id" ])
match_proff.head(3)

,Unnamed: 0_x,emails_id,matches_question_id,Unnamed: 0_y,emails_recipient_id,emails_date_sent,emails_frequency_level
0,0,1721939,332a511f1569444485cf7a7a556a5e54,1303869,172d6cac9efd4f41929430b163854b6b,2018-03-25 01:03:06 UTC+0000,email_notification_daily
1,1,1665388,332a511f1569444485cf7a7a556a5e54,1257634,430c9844fa3c410d88bb4c9e2fb95e99,2018-03-08 01:18:13 UTC+0000,email_notification_daily
2,2,1636634,332a511f1569444485cf7a7a556a5e54,1559127,82d34dd2bf8d4364b49c748080a4145f,2018-02-28 02:26:09 UTC+0000,email_notification_daily

In [96]:
students.head(3)

,students_id,students_location,students_date_joined
0,12a89e96755a4dba83ff03e03043d9c0,NaN,2011-12-16 14:19:24 UTC+0000
1,e37a5990fe354c60be5e87376b08d5e3,NaN,2011-12-27 03:02:44 UTC+0000
2,12b402cceeda43dcb6e12ef9f2d221ea,NaN,2012-01-01 05:00:00 UTC+0000

In [98]:
schools_members.head(3)

   school_memberships_school_id        school_memberships_user_id
0                        197406  23dce13ca6164a73aec7a3cd56a4884d
1                        197398  23dce13ca6164a73aec7a3cd56a4884d
2                        199821  23dce13ca6164a73aec7a3cd56a4884d

In [140]:
def group_students(x):
    x_list = x.tolist()
    if len(x_list)>1:
        if x_list[:-1] != x_list[-1:]:
            return x_list
        else:
            return x_list[0]
    else:
        return x
students_data_1 = students_data_1.groupby('students_id')

In [142]:
students_data_1 = pd.merge(students,schools_members, how = 'left', left_on = 'students_id', right_on = 'school_memberships_user_id')
students_data_1 =  students_data_1.groupby('students_id').agg(group_students)
students_data_1[students_data_1.school_memberships_school_id.notnull()]
students_data_1

,students_location,students_date_joined,school_memberships_school_id,school_memberships_user_id
students_id,,,,
0001a66883f74e8d91884fc6ea0d66a7,"Henderson, Texas",2018-08-21 00:18:57 UTC+0000,NaN,NaN
0004592176864233990d949862baa2f3,"Boston, Massachusetts",2016-03-09 18:52:24 UTC+0000,NaN,NaN
00069bb26ad64897b2793c81325a4440,"Philadelphia, Pennsylvania",2016-05-25 19:20:00 UTC+0000,NaN,NaN
0008238db56e45b9a40a9ddd219fab2f,"San Francisco, California",2015-03-17 17:55:20 UTC+0000,NaN,NaN
000b6972b8514f1b91a2c06e0cd7bccb,"Atlanta, Georgia",2016-08-20 18:28:57 UTC+0000,NaN,NaN
...,...,...,...,...
fff46fa7a17c4a92b4cbb4b93f1c65e0,"Providence, Rhode Island",2016-05-13 15:06:08 UTC+0000,NaN,NaN
fff57ab241e941069f4c4bfcd1ae62fd,"Santa Fe, New Mexico",2018-08-20 21:47:44 UTC+0000,NaN,NaN
fff89dee72064b88a0f8af21849878db,"Perth Amboy, New Jersey",2016-05-04 07:13:55 UTC+0000,NaN,NaN
fffa7a206167410e9282cc4b5cfa4275,"Alcoa, Tennessee",2016-07-23 22:09:34 UTC+0000,NaN,NaN
ffff97b3dc494767ac937a39396ee247,"Irving, Texas",2016-04-06 20:27:28 UTC+0000,NaN,NaN

In [139]:
students

,students_id,students_location,students_date_joined
0,12a89e96755a4dba83ff03e03043d9c0,NaN,2011-12-16 14:19:24 UTC+0000
1,e37a5990fe354c60be5e87376b08d5e3,NaN,2011-12-27 03:02:44 UTC+0000
2,12b402cceeda43dcb6e12ef9f2d221ea,NaN,2012-01-01 05:00:00 UTC+0000
3,a0f431fc79794edcb104f68ce55ab897,NaN,2012-01-01 05:00:00 UTC+0000
4,23aea4702d804bd88d1e9fb28074a1b4,NaN,2012-01-01 05:00:00 UTC+0000
...,...,...,...
30966,1154f74f4ac14aaf8ef1b15cdda2b84f,"Ottumwa, Iowa",2019-01-31 19:13:15 UTC+0000
30967,008c7ebabbdf4e7382870d172e6e6691,"Ottumwa, Iowa",2019-01-31 19:14:18 UTC+0000
30968,c445148b5fc8472da00f50b86dfd8faa,"Heckmondwike, England, United Kingdom",2019-01-31 21:04:31 UTC+0000
30969,44b3515e25454cfb80ed1df3a2a23f61,"Clermont, Florida",2019-01-31 22:29:57 UTC+0000
30970,1de9d7d0329e40e6996bbc92d13c6a00,NaN,2019-01-31 23:13:23 UTC+0000

In [124]:
A = pd.DataFrame({'students_id': [1,2,3], 'location':['A','B','C']})
B = pd.DataFrame({'school_id':[11,12,13], 'students_id':[1,2,2]})
C = pd.merge(A,B, how = 'left', on = ['students_id'])
def f(x):
    x_list = x.tolist()
    if len(x_list)>1:
        if x_list[:-1] != x_list[-1:]:
            return x_list
        else:
            return x_list[0]
    else:
        return x
C.groupby('students_id').agg(f)

            location     school_id
students_id
1                  A            11
2                  B  [12.0, 13.0]
3                  C           NaN

In [88]:
answers_matched = pd.merge(answers, match_proff, how='left', left_on=["professional_id", "question_id"], right_on = ['emails_recipient_id','matches_question_id'])

In [89]:
answers_matched['is_matched'] = answers_matched['emails_id'].fillna(0)
answers_matched.is_matched = answers_matched.is_matched.apply(lambda x: int(x>0))

In [94]:
students.head(3)

,students_id,students_location,students_date_joined
0,12a89e96755a4dba83ff03e03043d9c0,NaN,2011-12-16 14:19:24 UTC+0000
1,e37a5990fe354c60be5e87376b08d5e3,NaN,2011-12-27 03:02:44 UTC+0000
2,12b402cceeda43dcb6e12ef9f2d221ea,NaN,2012-01-01 05:00:00 UTC+0000

In [93]:
#adding questions columns
answers_matched_2 = pd.merge(answers_matched, questions, how = 'left', left_on = 'question_id', right_on = 'questions_id')
#adding student's data

,answers_id,professional_id,question_id,answers_date_added,answers_body,Unnamed: 0_x,emails_id,matches_question_id,Unnamed: 0_y,emails_recipient_id,emails_date_sent,emails_frequency_level,is_matched,questions_id,questions_author_id,questions_date_added,questions_title,questions_body
0,4e5f01128cae4f6d8fd697cec5dca60c,36ff3b3666df400f956f8335cf53e09e,332a511f1569444485cf7a7a556a5e54,2016-04-29 19:40:14 UTC+0000,<p>Hi!</p>\n<p>You are asking a very interesti...,168.0,306328.0,332a511f1569444485cf7a7a556a5e54,546074.0,36ff3b3666df400f956f8335cf53e09e,2016-04-26 11:15:09 UTC+0000,email_notification_immediate,1,332a511f1569444485cf7a7a556a5e54,8f6f374ffd834d258ab69d376dd998f5,2016-04-26 11:14:26 UTC+0000,Teacher career question,What is a maths teacher? what is a ma...
1,ada720538c014e9b8a6dceed09385ee3,2aa47af241bf42a4b874c453f0381bd4,eb80205482e4424cad8f16bc25aa2d9c,2018-05-01 14:19:08 UTC+0000,<p>Hi. I joined the Army after I attended coll...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...
2,eaa66ef919bc408ab5296237440e323f,cbd8f30613a849bf918aed5c010340be,eb80205482e4424cad8f16bc25aa2d9c,2018-05-02 02:41:02 UTC+0000,"<p>Dear Priyanka,</p><p>Greetings! I have answ...",NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,eb80205482e4424cad8f16bc25aa2d9c,acccbda28edd4362ab03fb8b6fd2d67b,2016-05-20 16:48:25 UTC+0000,I want to become an army officer. What can I d...,I am Priyanka from Bangalore . Now am in 10th ...
3,1a6b3749d391486c9e371fbd1e605014,7e72a630c303442ba92ff00e8ea451df,4ec31632938a40b98909416bdd0decff,2017-05-10 19:00:47 UTC+0000,<p>I work for a global company who values high...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,4ec31632938a40b98909416bdd0decff,f2c179a563024ccc927399ce529094b5,2017-02-08 19:13:38 UTC+0000,Will going abroad for your first job increase ...,I'm planning on going abroad for my first job....
4,5229c514000446d582050f89ebd4e184,17802d94699140b0a0d2995f30c034c6,2f6a9a99d9b24e5baa50d40d0ba50a75,2017-10-13 22:07:33 UTC+0000,I agree with Denise. Every single job I've had...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,2f6a9a99d9b24e5baa50d40d0ba50a75,2c30ffba444e40eabb4583b55233a5a4,2017-09-01 14:05:32 UTC+0000,To become a specialist in business management...,i hear business management is a hard way to ge...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
51186,74d708859d7e4d8c9d330506733e1fc3,b08b41c9e3724b609930779875b6b284,b64ef9cf0d33475ca9c22bdb8749f5a8,2016-10-01 08:42:28 UTC+0000,<p>Careers in law enforcement have different r...,4316055.0,803127.0,b64ef9cf0d33475ca9c22bdb8749f5a8,683197.0,b08b41c9e3724b609930779875b6b284,2016-10-01 00:02:15 UTC+0000,email_notification_daily,1,b64ef9cf0d33475ca9c22bdb8749f5a8,82cc74c0e18347e4b68b219e250eb10f,2016-05-28 03:08:07 UTC+0000,How can going to college help me advance my ca...,I am thinking about a career in law enforcemen...
51187,2070acba9f89433fa7dd9bcdc5f12351,f1ca9370286248aba5aae737f92a07dd,1b1ebe9afc5046ccbb328704e88e5cc0,2015-10-22 00:06:49 UTC+0000,<p>Well straight up I'm going to tell you it's...,4316256.0,179444.0,1b1ebe9afc5046ccbb328704e88e5cc0,501789.0,f1ca9370286248aba5aae737f92a07dd,2015-10-21 20:17:55 UTC+0000,email_notification_immediate,1,1b1ebe9afc5046ccbb328704e88e5cc0,d233c9936cd64363877ffea1feb10c35,2015-10-21 20:16:38 UTC+0000,Is age a factor for hiring entry level compute...,I am in my mid thirties with a Bachelor's degr...
51188,322bc9269c47467cbbee4f2b6b685ae2,9798c8df06244283ba14d30978ec318a,1b1ebe9afc5046ccbb328704e88e5cc0,2015-10-21 21:52:17 UTC+0000,"<p>When I was in my late thirties, with a bach...",4316105.0,179278.0,1b1ebe9afc5046ccbb328704e88e5cc0,436542.0,9798c8df06244283ba14d30978ec318a,2015-10-21 20:16:47 UTC+0000,email_notification_immediate,1,1b1ebe9afc5046ccbb328704e88e5cc0,d233c9936cd64363877ffea1feb10c35,2015-10-21 20:16:38 UTC+0000,Is age a factor for hiring entry level compute...,I am in my mid thirties with a Bachelor's degr...
51189,e554bc001ece4cda9ef9524a83239fbc,597cd583fb1049deb9b68ce308a992a8,1b1ebe9afc5046ccbb328704e88e5cc0,2015-10-21 20:22:39 UTC+0000,<p>I dont think age is a criteria at all. Expe...,4316157.0,179336.0,1b1ebe9afc5046ccbb328704e88e5cc0,177973.0,597cd583fb1049deb9b68ce308a992a8,2015-10-21 20:17:11 UTC+0000,email_notification_immediate,1,1b1ebe9afc5046ccbb328704e88e5cc0,d233c9936cd64363877ffea1feb10c35,2015-10-21 20:16:38 UTC+0000,Is age a factor for hiring entry level compute...,I am in my mid thirties with a Bachelor's degr...
51190,563bc22e715e42bfb4b6ef9c3a95fb23,5750e3d592cd4b0486ec4e7eb01c29ad,1b1ebe9afc5046ccbb328704e88e5cc0,2016-03-07 01:19:40 UTC+0000,<p>This is a great question.</p>\n<p>For many ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,1b1ebe9afc5046ccbb328704e88e5cc0,d233c9936cd64363877ffea1feb10c35,2015-10-21 20:16:38 UTC+0000,Is age a factor for hiring entry level compute...,I am in my mid thirties with a Bachelor's degr...

In [ ]:
answers_data = answers_matched[['answers_id', 'professional_id', 'question_id', 'answers_date_added',
       'answers_body', 'Unnamed: 0_x', 'emails_id', 'matches_question_id',
       'Unnamed: 0_y', 'emails_recipient_id', 'emails_date_sent',
       'emails_frequency_level', 'is_matched']]

#NLP Functions

In [ ]:
#Functions for NLP

def lowercase(input):
  return input.lower()

def remove_punctuation(input):
  return input.translate(str.maketrans('','', string.punctuation))

def remove_whitespaces(input):
  return " ".join(input.split())
  
def remove_html_tags(input):
    soup = BeautifulSoup(input, "html.parser")
    stripped_input = soup.get_text(separator=" ")
    return stripped_input

def tokenize(input):
  return word_tokenize(input)

def remove_stop_words(input):
  input = word_tokenize(input)
  return [word for word in input if word not in stopwords.words('english')]

def lemmatize(input):
  lemmatizer=WordNetLemmatizer()
  input_str=word_tokenize(input)
  new_words = []
  for word in input_str:
    new_words.append(lemmatizer.lemmatize(word))
  return ' '.join(new_words)

#Function that calls all other functions together to perform NLP on a given text
def nlp_pipeline(input):
  return lemmatize(' '.join(remove_stop_words(remove_whitespaces(remove_punctuation(remove_html_tags(lowercase(input)))))))

#Topic Modeling for individual questions

In [ ]:
from sklearn.feature_extraction.text import CountVectorizer
from sklearn.decomposition import LatentDirichletAllocation as LDA

#Turn tags into a set for faster checking of whether a tag exists or not
unique_tags = set(tags['tags_tag_name'])

def find_topics(question_body):
  """
  Function that takes a question as an input, and finds the two most important topics/tags
  If the found topics exist in the already existing database of tags, we add these tags
  to the professional who answered the question
  """

  text = nlp_pipeline(question_body)
  count_vectorizer = CountVectorizer(stop_words='english')
  count_data = count_vectorizer.fit_transform([text])
  # One topic that has an avg of two words because most questions had 1/2 tags
  number_topics = 1
  number_words = 2
  # Create and fit the LDA model
  lda = LDA(n_components=number_topics, n_jobs=-1)
  lda.fit(count_data)

  words = count_vectorizer.get_feature_names()

  #Get topics from model. They are represented as a list e.g. ['military','army']
  topics = [words[i] for i in topic.argsort()[:-number_words - 1:-1] for topic_idx, topic in enumerate(lda.components_)]

  #Only use topics for which a tag already exists
  existing_topics = []
  for tag in topics:
    if tag in unique_tags:
      existing_topics.append(tag)

  return existing_topics